# St7GetLaminateNumPlies

Returns the number of plies in the specified laminate.

Strand7 API Manual

long St7GetLaminateNumPlies(long uID, long LaminateID, long* NumPlies)

Input Parameters

uID

Strand7 model file ID.

LaminateID

Laminate layout ID.

Output Parameters
NumPlies

Number of plies.